# AddValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition..::..AddValue Method
ElectricalDemandFactorDefinition Class See Also
---
Adds a value to the value set for this demand factor definition
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void AddValue(
	ElectricalDemandFactorValue dfValue
)
```

Visual Basic
---
```text
Public Sub AddValue ( _
	dfValue As ElectricalDemandFactorValue _
)
```

Visual C++
---
```text
public:
void AddValue(
	ElectricalDemandFactorValue^ dfValue
)
```

# ### Parameters
dfValue
    Type: Autodesk.Revit.DB.Electrical..::..ElectricalDemandFactorValue Value to add to the set
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace